In [47]:
import mysql.connector

In [48]:
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="1234",
  database='test'
)

In [49]:
mycursor = mydb.cursor(buffered=True)

In [50]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)

In [52]:
mycursor.execute("CREATE TABLE customers (name VARCHAR(255), address VARCHAR(255))")

In [53]:
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John","Address")
mycursor.execute(sql,val)

In [54]:
mycursor.execute("SHOW TABLES")
for x in mycursor:
    print(x)

('contact',)
('courses',)
('customers',)
('dummy',)
('dummy1',)
('enrolment',)
('students',)

In [55]:
mydb.commit()

In [57]:
print(mycursor.rowcount)

7

In [72]:
mycursor.execute("SELECT * FROM dummy")

In [73]:
records = mycursor.fetchall()

In [60]:
print(records)

[(12, 'S4', 11, 'course 1', 2), (13, 'S3', 12, 'course 2', 3), (11, 'S1', 13, 'course 3', 4), (15, 'S7', 16, 'Missing', None)]

In [61]:
import pandas as pd

In [74]:
records = pd.DataFrame(records)
records.columns = [i[0] for i in mycursor.description]

In [75]:
print(records)

   enrolment_id student_id  course_id course_name  duration_year
0            12         S4         11    course 1            2.0
1            13         S3         12    course 2            3.0
2            11         S1         13    course 3            4.0
3            15         S7         16     Missing            NaN

In [76]:
pd.read_sql('SELECT * FROM dummy',mydb)

   enrolment_id student_id  course_id course_name  duration_year
0            12         S4         11    course 1            2.0
1            13         S3         12    course 2            3.0
2            11         S1         13    course 3            4.0
3            15         S7         16     Missing            NaN